<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b2749c2d1b4e14c97c72303c197a27e3565818b276a7786c6a785a6af952cfc4","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1544 at https://github.com/cal-itp/data-infra/actions/runs/22420751218","plan_out_hash":"29ce5f4c36f8e5c2b64e59f3d6c6f958102872c7489bbefb4052170ee506a61e","plan_hash":"86a265c70079166d49b5f3a8cdbffc194a7bfb449ff0cabb5ff4a8f9d5cdc958","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "MzBxMQ==" -> (known after apply)
!~      detect_md5hash      = "MwGJBK5X+kZyxQ+wOldVsQ==" -> "different hash"
!~      generation          = 1770171455625148 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "MwGJBK5X+kZyxQ+wOldVsQ==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "EHiqFQ==" -> (known after apply)
!~      detect_md5hash      = "dpt0pd7Pstuj+JVeigq+hw==" -> "different hash"
!~      generation          = 1771975108672678 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "dpt0pd7Pstuj+JVeigq+hw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1L9xfw==" -> (known after apply)
!~      detect_md5hash      = "LN7bLgWxoq+JBmyafaJc6A==" -> "different hash"
!~      generation          = 1771975110569123 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "LN7bLgWxoq+JBmyafaJc6A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1544](https://github.com/cal-itp/data-infra/actions/runs/22420751218)